<?php

declare(strict_types=1);

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые Ресурсы Постраничного Вывода
    |--------------------------------------------------------------------------
    |
    | Следующие языковые ресурсы используются библиотекой постраничного вывода
    | для создания простых ссылок на страницы. Вы можете изменить их на все,
    | что хотите, чтобы они лучше соответствовали вашему приложению.
    |
    */

    'next' => 'Вперёд &raquo;',
    'previous' => '&laquo; Назад',

];
