<?php

return [
    'widgets' => [
        'dependency' => [
            'heading' => 'Установленные зависимости',
            'description' => 'Список подключенных библиотек с доступными обновлениями',
            'empty' => 'Нет пакетов с доступными обновлениями',
            'table' => [
                'name' => 'Наименивание',
                'version' => 'Версия',
            ],
        ],
        'system' => [
            'heading' => 'System details',
            'description' => 'Общая информация о системном окружении',
        ],
    ],
];
