<?php

declare(strict_types=1);

return [
    [
        'text' => 'Давно пользуюсь и все норм. Ни за что не плачу, спокойно продаю что нужно и покупаю что увижу. Замутили неплохую доставку – теперь можно даже при получении оплачивать и не бояться.',
        'name' => 'Павел Ларионов',
        'position' => 'Директор сети кофитериев “Лайк”',
        'avatar' => 'images/card-avatars/1.png',
    ],
    [
        'text' => 'Несколько лет трудимся с ними вместе и очень довольны результатами совместной работы. Хотим отметить ответственность и профессионализм их сотрудников. Сервис, который они разработали, обладает великолепным функционалом и помогает людям находить самое лучшее.',
        'name' => 'Дмитрий Валентинов',
        'position' => 'Основатель школы макияжа и стиля, организатор мероприятий в сфере красоты и моды.',
        'avatar' => 'images/card-avatars/2.png',
    ],
    [
        'text' => 'Из всех торговых площадок, на которых я пробовала продавать, GMсамая массовая и удобная. Тут на объявление реагируют быстро и продажи идут практически сразу после подачи заявки. Все, конечно, от товара зависит. В моем случае – это корейская косметика. Дела пошли сразу, я довольна. На других сайтах ждала клиента неделями, а тут каждый день практически что-то продаю.',
        'name' => 'Илона Семенова',
        'position' => 'Основатель школы макияжа и стиля Корейской косметики “КореяШоп”',
        'avatar' => 'images/card-avatars/3.png',
    ],
    [
        'text' => 'Давно пользуюсь и все норм. Ни за что не плачу, спокойно продаю что нужно и покупаю что увижу. Замутили неплохую доставку – теперь можно даже при получении оплачивать и не бояться.',
        'name' => 'Павел Ларионов',
        'position' => 'Директор сети кофитериев “Лайк”',
        'avatar' => 'images/card-avatars/4.png',
    ],
    [
        'text' => 'Несколько лет трудимся с ними вместе и очень довольны результатами совместной работы. Хотим отметить ответственность и профессионализм их сотрудников. Сервис, который они разработали, обладает великолепным функционалом и помогает людям находить самое лучшее.',
        'name' => 'Дмитрий Валентинов',
        'position' => 'Основатель школы макияжа и стиля, организатор мероприятий в сфере красоты и моды.',
        'avatar' => 'images/card-avatars/5.png',
    ],
];
