<script setup lang="ts">
import { ref } from 'vue';
import { Ckeditor } from '@ckeditor/ckeditor5-vue';
import { ClassicEditor, Bold, Essentials, Italic, Paragraph, Undo, Link, List, Heading } from 'ckeditor5';
import ToggleSwitch from './ToggleSwitch.vue';

import 'ckeditor5/ckeditor5.css';

const textEditorOpen = ref(false);
const description = ref(`
<p>✨ «-30% на всё от Desigual» ✨</p>
<p>Приготовьтесь к яркому обновлению гардероба! Бренд Desigual дарит вам уникальную возможность приобрести любую вещь из своего ассортимента со скидкой 30%.</p>
<p>🗓️ Срок действия акции: Предложение действует с [Укажите дату начала акции] по [Укажите последний день текущего месяца]. Успейте воспользоваться!</p>
<p>🛍️ Что входит в акцию: Скидка 30% распространяется на абсолютно все товары в каталоге Desigual:</p>
<p>Одежда: платья, юбки, брюки, джинсы, куртки, пальто, футболки, рубашки, свитера и многое другое для мужчин и женщин.</p>
<p>Обувь: кроссовки, ботинки, сапоги, туфли, сандалии.</p>
<p>Аксессуары: сумки, рюкзаки, шарфы, головные уборы, украшения, ремни.</p>
<p>И другие категории товаров бренда Desigual.</p>
<p>📍 Где действует акция:</p>
<p>Онлайн: на официальном сайте Desigual [укажите ссылку на сайт, если применимо].</p>
<p>Оффлайн: во всех фирменных магазинах Desigual, расположенных в [укажите города или регионы, где действует акция, например: "Москве и Санкт-Петербурге"].</p>
<p>⚠️ Важные условия:</p>
<p>Скидка 30% применяется автоматически при оформлении заказа или на кассе.</p>
<p>Акция не суммируется с другими скидками, специальными предложениями и промокодами.</p>
<p>Количество товаров ограничено.</p>
<p>Возврат и обмен товаров осуществляется согласно стандартным правилам магазина.</p>
<p>Организатор акции оставляет за собой право изменить условия или досрочно завершить акцию.</p>
<p>Не упустите шанс добавить красок в свою жизнь с Desigual! 💖</p>
`);
const conditions = ref('');

const editor = ClassicEditor;
const editorConfig = {
    plugins: [Essentials, Bold, Italic, Paragraph, Undo, Link, List, Heading],
    toolbar: {
        items: ['undo', 'redo', '|', 'heading', '|', 'bold', 'italic', '|', 'link', '|', 'bulletedList', 'numberedList']
    },
    licenseKey: 'GPL'
};

const emit = defineEmits<{
    openConditionsModal: [];
}>();
</script>

<template>
    <div class="mt-8 flex w-full flex-col rounded-2xl bg-white p-8 max-md:p-4">
        <h3 class="mb-4 font-bold">Описание акции</h3>
        <Ckeditor v-model="description" :editor="editor" :config="editorConfig" />
        <div class="my-6">
            <div class="h-[1px] w-full bg-black/30"></div>
            <div class="my-4 flex flex-row items-center justify-between max-md:flex-col max-md:items-start">
                <p class="all_text mr-10 text-black/50 max-md:mr-0 max-md:mb-4">
                    <strong class="text-base text-black">Допополнительные условия.</strong>
                    Если по вашей акции есть какие-то дополнительные условия, о которых вы считаете нужным заявить - вы можете сделать это ниже. Если
                    никаких дополнительных условий нет, то оставьте поле пустым.
                    <span @click="emit('openConditionsModal')" class="ml-3 cursor-pointer text-[#2578cf] hover:underline">Подробнее</span>
                </p>
                <ToggleSwitch v-model="textEditorOpen" />
            </div>
        </div>
        <div v-show="textEditorOpen" class="mb-4">
            <div class="h-[1px] w-full bg-black/30"></div>
            <Ckeditor v-model="conditions" :editor="editor" :config="editorConfig" />
        </div>
    </div>
</template>

<style>
.ck-editor__editable {
    min-height: 200px;
}
</style>
